### 1.

#### 0부터 1,000,000까지의 임의의 정수를 10개 연속적으로 출력하는 의사난수 함수 my_rand()를 생성하여라. <br>(1) 이 의사난수를 만들기 위한 계수 값과 식을 적으시오.

In [46]:
def my_rand(x):
    x=(1103515245*x+12345)%1000001
    return x

X=100
for _ in range(10):
    X=my_rand(X)
    print(X)

426494
271215
895433
265452
898050
773721
76925
346145
516968
708007

#### (2) 이 의사난수를 만들기 위한 초기 씨드 값으로 time 모듈의 time()함수를 사용하여 다시 코딩하시오 ( 힌트: time()값은 실수 값이므로 이를 정수로 변환하여 사용해야한다). 이번에는 0에서 1,000,000까지의 임의의 5개의 정수를 출력하고 이를 다음과 같이 2번 반복하여라.

In [20]:
import time
def my_rand(x):
    x=(1103515245*x+12345)%1000001
    return x

X=int(time.time())
for _ in range(2):
    for _ in range(5):
        X=my_rand(X)
        print(X)
    print()

801945
206222
297842
940777
496987

646978
242583
996410
730270
115223

### 2.

#### math 모듈을 사용하여 0도에서 180도까지 10도 단위로 sin,cos,tan값을 구하여 다음과 같이 출력하여라.

In [29]:
import math as m
for i in range(0,181,10):
    print("sin({:3})={:6.3f},cos({:3})={:6.3f},tan({:3})={:6.3f}".format(i,m.sin(m.radians(i)),i,m.cos(m.radians(i)),i,m.tan(m.radians(i))))

sin(  0)= 0.000,cos(  0)= 1.000,tan(  0)= 0.000
sin( 10)= 0.174,cos( 10)= 0.985,tan( 10)= 0.176
sin( 20)= 0.342,cos( 20)= 0.940,tan( 20)= 0.364
sin( 30)= 0.500,cos( 30)= 0.866,tan( 30)= 0.577
sin( 40)= 0.643,cos( 40)= 0.766,tan( 40)= 0.839
sin( 50)= 0.766,cos( 50)= 0.643,tan( 50)= 1.192
sin( 60)= 0.866,cos( 60)= 0.500,tan( 60)= 1.732
sin( 70)= 0.940,cos( 70)= 0.342,tan( 70)= 2.747
sin( 80)= 0.985,cos( 80)= 0.174,tan( 80)= 5.671
sin( 90)= 1.000,cos( 90)= 0.000,tan( 90)=16331239353195370.000
sin(100)= 0.985,cos(100)=-0.174,tan(100)=-5.671
sin(110)= 0.940,cos(110)=-0.342,tan(110)=-2.747
sin(120)= 0.866,cos(120)=-0.500,tan(120)=-1.732
sin(130)= 0.766,cos(130)=-0.643,tan(130)=-1.192
sin(140)= 0.643,cos(140)=-0.766,tan(140)=-0.839
sin(150)= 0.500,cos(150)=-0.866,tan(150)=-0.577
sin(160)= 0.342,cos(160)=-0.940,tan(160)=-0.364
sin(170)= 0.174,cos(170)=-0.985,tan(170)=-0.176
sin(180)= 0.000,cos(180)=-1.000,tan(180)=-0.000

## 3.

#### 로미오와 줄리엣 두 사람이 가위바위보를 한다. 로미오와 줄리엣의 승부는 random 모듈의 randrange()를 통해서 생성한 난수를 바탕으로 한다. 출력 결과는 다음과 같이 로미오가 이기거나 줄리엣이 이기거나 비기는 결과가 나와야한다.

In [ ]:
import random as rd

def RSP(num):
    if num==0:
        return "가위"
    elif num==1:
        return "바위"
    else :
        return "보"
    
rom = rd.randrange(-1,2)
jul = rd.randrange(-1,2)

print("로미오의 승부 : ",RSP(rom))
print("줄리엣의 승부 : ",RSP(jul))

if jul==rom:
    print("비겼습니다")
elif RSP(rom)=="가위":
    if RSP(jul)=="보":
        print("로미오가 이겼습니다")
    else:
        print("줄리엣이 이겼습니다")
elif RSP(rom)=="바위":
    if RSP(jul)=="보":
        print("줄리엣이 이겼습니다")
    else:
        print("로미오가 이겼습니다")
else:
    if RSP(jul)=="가위":
        print("줄리엣이 이겼습니다")
    else:
        print("로미오가 이겼습니다")

## 4.

#### 랜덤 숫자 맞추기 게임 프로그램을 작성하라. 먼저 랜덤하게 1~20까지의 숫자 x를 하나 생성시키고 사용자는 숫자를 하나씩 입력하면서 생성된 숫자 x와 비교해 큰지 작은지를 보고 숫자를 맞춰가는 게임이다. 컴퓨터는 사용자가 입력한 숫자가 정답보다 큰지 작은지를 알려주어야한다. 그리고 사용자가 시도를 할 때마다 시도한 횟수가 n에 저장되도록 한다. 만일 입력한 숫자와 x가 일치하면 “정답입니다!”라는 메시지를 출력한다. 이때 3번 이하로 입력하여 숫자를 맞추면 “n번만에 맞춘 당신은 천재!” 3번이상 6번 이하로 입력하여 숫자를 맞추면 “n번 만에 맞추다니 쩝쩝…” 이라고 출력하라.

In [71]:
import random as rd
x = rd.randrange(1,20)
count=1
while True:
    user = int(input("1~20까지의 숫자를 입력하세요:"))
    if user == x:
        print("정답입니다!")
        if count<3:
            print(count,"번만에 맞춘 당신은 천재!")
        elif count>=3 and count<=6:
            print(count,"번만에 맞추셨네요. 잘했어요^^")
        else:
            print(count,"번만에 맞추다니 쩝쩝...")
        break
    elif user>x:
        print(user,"보다 작습니다!")
    else:
        print(user,"보다 큽니다!")
    count+=1

1~20까지의 숫자를 입력하세요:1
1 보다 큽니다!
1~20까지의 숫자를 입력하세요:2
2 보다 큽니다!
1~20까지의 숫자를 입력하세요:3
3 보다 큽니다!
1~20까지의 숫자를 입력하세요:4
4 보다 큽니다!
1~20까지의 숫자를 입력하세요:5
5 보다 큽니다!
1~20까지의 숫자를 입력하세요:6
6 보다 큽니다!
1~20까지의 숫자를 입력하세요:7
7 보다 큽니다!
1~20까지의 숫자를 입력하세요:8
8 보다 큽니다!
1~20까지의 숫자를 입력하세요:9
9 보다 큽니다!
1~20까지의 숫자를 입력하세요:10
정답입니다!
10 번만에 맞추다니 쩝쩝...

## 5.

#### 첨부한 파일 “movies.csv”를 이용해 다음의 과정을 실행하시오.<br>⑴ pandas 라이브러리를 import 후 “movies.csv”를 읽어 들여 Dataframe movies에 저장하고 앞과 뒤의 자료 10개씩 보이시오.

In [77]:
import pandas as pd
Dataframe_movies= pd.read_csv("movies.csv")

In [78]:
Dataframe_movies.head(10)

   Rank                         Title       Studio       Gross  Year
0     1             Avengers: Endgame  Buena Vista  $2,796.30   2019
1     2                        Avatar          Fox  $2,789.70   2009
2     3                       Titanic    Paramount  $2,187.50   1997
3     4  Star Wars: The Force Awakens  Buena Vista  $2,068.20   2015
4     5        Avengers: Infinity War  Buena Vista  $2,048.40   2018
5     6                Jurassic World    Universal  $1,671.70   2015
6     7         Marvel's The Avengers  Buena Vista  $1,518.80   2012
7     8                     Furious 7    Universal  $1,516.00   2015
8     9       Avengers: Age of Ultron  Buena Vista  $1,405.40   2015
9    10                 Black Panther  Buena Vista  $1,346.90   2018

In [79]:
Dataframe_movies.tail(10)

     Rank                         Title           Studio    Gross  Year
772   773        Fun with Dick and Jane             Sony  $202.00  2005
773   774  Teenage Mutant Ninja Turtles         New Line  $202.00  1990
774   775              Kindergarten Cop        Universal  $202.00  1990
775   776        Straight Outta Compton        Universal  $201.60  2015
776   777                21 Jump Street             Sony  $201.60  2012
777   778                     Yogi Bear  Warner Brothers  $201.60  2010
778   779           Garfield: The Movie              Fox  $200.80  2004
779   780                   Cats & Dogs  Warner Brothers  $200.70  2001
780   781      The Hunt for Red October        Paramount  $200.50  1990
781   782                      Valkyrie              MGM  $200.30  2008

#### ⑵ movies의 행과 열의 수 및 cell의 총 갯수를 출력하시오.

In [83]:
print("행의 수: ",Dataframe_movies.shape[0])
print("열의 수: ",Dataframe_movies.shape[1])
print("셀의 총 갯수: ",Dataframe_movies.shape[0]*Dataframe_movies.shape[1])

행의 수:  782
열의 수:  5
셀의 총 갯수:  3910

####   ⑶ movies의 자료형을 보이시오.

In [85]:
Dataframe_movies.dtypes

Rank       int64
Title     object
Studio    object
Gross     object
Year       int64
dtype: object

####   ⑷ movies의 500번째 자료를 보이시오.

In [88]:
Dataframe_movies.iloc[499,:]

Rank                              500
Title     Maze Runner: The Death Cure
Studio                            Fox
Gross                         $288.30
Year                             2018
Name: 499, dtype: object

####   ⑸ 영화 제목(Title)에 “Forrest Gump”이 있는 행을 출력하시오.

In [93]:
Dataframe_movies[:][Dataframe_movies["Title"]=="Forrest Gump"]

     Rank         Title     Studio    Gross  Year
118   119  Forrest Gump  Paramount  $677.90  1994

####   ⑹ 영화 상영 연도(Year)를 기준으로 하여 내림차순으로 정렬하고 앞 10개의 자료를 보이시오.

In [96]:
Dataframe_movies.sort_values(by='Year', ascending=False).head(10)

,Rank,Title,Studio,Gross,Year
0,1,Avengers: Endgame,Buena Vista,"$2,796.30",2019
457,458,John Wick: Chapter 3 - Parabellum,Lionsgate,$304.70,2019
113,114,The Wandering Earth,China Film Corporation,$699.80,2019
197,198,Toy Story 4,Buena Vista,$519.80,2019
198,199,How to Train Your Dragon: The Hidden World,Universal,$519.80,2019
262,263,Pokemon Detective Pikachu,Warner Brothers,$427.50,2019
285,286,Alita: Battle Angel,Fox,$404.90,2019
314,315,Godzilla: King of the Monsters,Warner Brothers,$378.10,2019
339,340,Shazam!,Warner Brothers,$364.10,2019
368,369,Dumbo,Buena Vista,$351.80,2019

####   ⑺ 영화 제작사(Studio)는 오름차순, 영화 상영 연도(Year)는 내림차순으로 정렬하고 마지막 10개의 자료를 보이시오.

In [104]:
df = Dataframe_movies.sort_values(by='Studio')
df = Dataframe_movies.sort_values(by='Year',ascending=False)
df.tail(10)

     Rank                               Title           Studio    Gross  Year
451   452  Close Encounters of the Third Kind         Columbia  $306.90  1977
90     91                           Star Wars              Fox  $775.40  1977
629   630                Saturday Night Fever        Paramount  $237.10  1977
227   228                                Jaws        Universal  $470.70  1975
251   252                        The Exorcist  Warner Brothers  $441.30  1973
603   604                       The Godfather        Paramount  $245.10  1972
754   755                     The Jungle Book      Buena Vista  $205.80  1967
707   708                      101 Dalmatians      Buena Vista  $215.90  1961
539   540                               Bambi              RKO  $267.40  1942
287   288                  Gone with the Wind              MGM  $402.40  1939

####   ⑻ 2015년에 상영된 영화 중에서 제작사가 “Universal”인 영화를 보이시오.

In [147]:
df = Dataframe_movies.loc[(Dataframe_movies.Studio=="Universal")&(Dataframe_movies.Year==2015),'Title']
df

5              Jurassic World
7                   Furious 7
18                    Minions
164      Fifty Shades of Grey
503           Pitch Perfect 2
701                     Ted 2
765                   Everest
775    Straight Outta Compton
Name: Title, dtype: object

####  ⑼ 2015년에 상영된 영화 또는 제작사가 “Universal”인 영화를 보이시오.

In [157]:
df = Dataframe_movies.loc[(Dataframe_movies.Studio=="Universal")|(Dataframe_movies.Year==2015),"Title"]
df

3        Star Wars: The Force Awakens
5                      Jurassic World
7                           Furious 7
8             Avengers: Age of Ultron
12     Jurassic World: Fallen Kingdom
                    ...
762                      The Break-Up
765                           Everest
771                       Patch Adams
774                  Kindergarten Cop
775            Straight Outta Compton
Name: Title, Length: 140, dtype: object

####  ⑽ 1975년 이전에 상영된 영화를 보이시오.

In [158]:
df = Dataframe_movies.loc[Dataframe_movies.Year<1975,"Title"]
df

251          The Exorcist
287    Gone with the Wind
539                 Bambi
603         The Godfather
707        101 Dalmatians
754       The Jungle Book
Name: Title, dtype: object

####  ⑾ 1980년에서 1990년도 사이에 상영된 영화를 보이시오.

In [159]:
df = Dataframe_movies.loc[(Dataframe_movies.Year<1990)&(Dataframe_movies.Year>1980),"Title"]
df

83              E.T.: The Extra-Terrestrial
221                      Return of the Jedi
224      Indiana Jones and the Last Crusade
277                                  Batman
299                 Raiders of the Lost Ark
310                      Back to the Future
356                                 Top Gun
360                                Rain Man
402    Indiana Jones and the Temple of Doom
405              Back to the Future Part II
409                 Who Framed Roger Rabbit
412                        Crocodile Dundee
427                        Fatal Attraction
431                       Beverly Hills Cop
466                                Rocky IV
468              Rambo: First Blood Part II
472                    Beverly Hills Cop II
479                      Look Who's Talking
484                            Ghostbusters
495                       Coming to America
622                     Crocodile Dundee II
635                      Dead Poets Society
659                         Lethal Weapon 2
661                           Out of Africa
678                Honey, I Shrunk the Kids
703                                   Twins
710                         Ghostbusters II
715                           Dirty Dancing
737                      The Little Mermaid
Name: Title, dtype: object

####   ⑿ 영화의 제목에 “dark”가 포함된 영화를 보이시오(대소문자 구별 없음).

In [165]:
df = Dataframe_movies[Dataframe_movies['Title'].str.contains('Dark')]
df

     Rank                           Title           Studio       Gross  Year
22     23  Transformers: Dark of the Moon        Paramount  $1,123.80   2011
26     27           The Dark Knight Rises  Warner Brothers  $1,084.90   2012
38     39                 The Dark Knight  Warner Brothers  $1,004.90   2008
131   132            Thor: The Dark World      Buena Vista     $644.60  2013
231   232         Star Trek Into Darkness        Paramount     $467.40  2013
308   309             Fifty Shades Darker        Universal     $381.50  2017
599   600                    Dark Shadows  Warner Brothers     $245.50  2012
602   603                    Dark Phoenix              Fox     $245.10  2019

In [187]:
Dataframe_movies['Gross'].dtype

dtype('float64')

####   ⒀ 영화의 수익(Gross)에 대해 요약 통계량을 보이시오.

In [189]:
Dataframe_movies["Gross"].describe()

count     782.000000
mean      439.030818
std       293.850989
min       200.300000
25%       249.350000
50%       341.150000
75%       521.125000
max      2796.300000
Name: Gross, dtype: float64

####  ⒁ 영화 제작사별로 수익의 합계를 앞의 10개를 보이시오.

In [252]:
total = Dataframe_movies.groupby('Studio')['Gross'].sum()
total.head(10)

Studio
Artisan                     248.6
Buena Vista               73585.0
CL                          228.1
China Film Corporation      699.8
Columbia                   1276.6
Dimension                   488.7
Dreamworks                12260.4
FR                          385.3
FUN                         358.0
Focus                       205.8
Name: Gross, dtype: float64

####  ⒂ 영화 제작사별로 수익의 합계를 내림차순으로 정렬하여 앞의 10개를 보이시오.

In [251]:
total = Dataframe_movies.groupby('Studio')['Gross'].sum()
total.sort_values(ascending=False).head(10)

Studio
Buena Vista        73585.0
Warner Brothers    58643.8
Fox                50420.8
Universal          44302.3
Sony               32822.5
Paramount          32486.0
Dreamworks         12260.4
Lionsgate          10033.2
New Line            6584.8
MGM                 3513.1
Name: Gross, dtype: float64

#### 영화 제작사별로 수익의 최대, 최소, 평균 값, 최대평균 내림차순 앞 10개만

In [254]:
Group = Dataframe_movies.groupby('Studio')['Gross'].agg({'sum','max','min'})
Group.sort_values(by='sum',ascending=False).head(10)

                    max    min      sum
Studio
Buena Vista      2796.3  202.4  73585.0
Warner Brothers  1341.7  200.7  58643.8
Fox              2789.7  200.8  50420.8
Universal        1671.7  201.6  44302.3
Sony             1108.6  201.6  32822.5
Paramount        2187.5  200.5  32486.0
Dreamworks        919.8  217.8  12260.4
Lionsgate         865.0  214.7  10033.2
New Line         1119.9  202.0   6584.8
MGM               432.0  200.3   3513.1

## 6.

#### 아래와 같이 입력된 pandas series가 있다. 아래 과정을 실시하고 그 결과를 보이시오.(문제를 풀기 전에 import numpy as np를 실행)<br>s = pd.Series([1, 2, 3, np.nan, 4, 5])<br>⑴ 결측치(np.nan)을 제외하면서 합을 구하시오(sum() 이용).

In [191]:
import numpy as np
s = pd.Series([1, 2, 3, np.nan, 4, 5])

In [192]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    4.0
5    5.0
dtype: float64

####   ⑵ 결측치(np.nan)을 포함하면서 합을 구하시오(sum() 이용)

In [195]:
Sum = s.sum(skipna=False)
print(Sum)

nan

####   ⑶ 결측치(np.nan)을 포함하면서 누적합을 구하시오(cumsum() 이용).

In [197]:
s.cumsum(skipna=False)

0     1.0
1     3.0
2     6.0
3     NaN
4    10.0
5    15.0
dtype: float64

In [200]:
s.mean() #평균

3.0

In [202]:
s.var() #분산

2.5

In [203]:
s.max()

5.0

In [204]:
s.min()

1.0

## 7.

#### 7. 첨부한 파일 “revolutionary_war.csv”를 아래 프로그램을 통해 읽고 다음의 과정을 실행하시오. <br>days_of_war = pd.read_csv("revolutionary_war.csv", usecols = ["Start Date"],parse_dates=["Start Date"], squeeze = True)<br>⑴ 요일을 반환하는 함수 day_of_week를 정의하고 아래와 같이 출력하시오. <br> (Hint : date.strftime() 메소드 이용)

In [310]:
import pandas as pd

days_of_war = pd.read_csv("revolutionary_war.csv", usecols=["Start Date"], parse_dates=["Start Date"]).squeeze("columns")

def day_of_week(date):
    if pd.notna(date):
        return date.strftime("%A")
    else:
        return "Not a valid date"

days_of_war_weekday = days_of_war.apply(day_of_week)

print(days_of_war_weekday)

0       Thursday
1      Wednesday
2      Wednesday
3      Wednesday
4       Thursday
         ...
227    Wednesday
228       Friday
229       Friday
230       Friday
231    Wednesday
Name: Start Date, Length: 232, dtype: object

#### ⑵ 아래와 같이 각 요일별 빈도를 출력하시오

In [311]:
days_of_war_weekday = days_of_war.apply(day_of_week)
weekday_counts = days_of_war_weekday.value_counts().reset_index()
weekday_counts.columns = ["Weekday", "Frequency"]

print(weekday_counts)

            Weekday  Frequency
0          Saturday         39
1            Friday         39
2         Wednesday         32
3          Thursday         31
4            Sunday         31
5           Tuesday         29
6            Monday         27
7  Not a valid date          4